loading packages;
building model;
fitting model;
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 40, 40, 48)        17472     
_________________________________________________________________
activation_1 (Activation)    (None, 40, 40, 48)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 19, 19, 48)        0         
_________________________________________________________________
zero_padding2d_1 (ZeroPaddin (None, 23, 23, 48)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 19, 19, 128)       153728    
_________________________________________________________________
activation_2 (Activation)    (None, 19, 19, 128)       0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 9, 9, 128)         0         
_________________________________________________________________
zero_padding2d_2 (ZeroPaddin (None, 11, 11, 128)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 9, 9, 192)         221376    
_________________________________________________________________
activation_3 (Activation)    (None, 9, 9, 192)         0         
_________________________________________________________________
zero_padding2d_3 (ZeroPaddin (None, 11, 11, 192)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 9, 9, 192)         331968    
_________________________________________________________________
activation_4 (Activation)    (None, 9, 9, 192)         0         
_________________________________________________________________
zero_padding2d_4 (ZeroPaddin (None, 11, 11, 192)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 9, 9, 128)         221312    
_________________________________________________________________
activation_5 (Activation)    (None, 9, 9, 128)         0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 4, 4, 128)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 2048)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
activation_6 (Activation)    (None, 2048)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 2048)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              4196352   
_________________________________________________________________
activation_7 (Activation)    (None, 2048)              0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 2048)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 2)                 4098      
_________________________________________________________________
activation_8 (Activation)    (None, 2)                 0         
=================================================================
Total params: 9,342,658
Trainable params: 9,342,658
Non-trainable params: 0
_________________________________________________________________
